StoveOpt/foamfiles/counterFlowFlame2D/case_33/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

vertices
(
(0.0 0.0 0.0)
(0.0 0.1 0.0)
(0.0 0.0 0.15)
(0.0 0.1 0.15)
(0.0 0.1 0.16)
(0.0 0.0 0.16)
(0.0 0.0 0.3)
(0.0 0.1 0.3)
(0.0 0.17 0.3)
(0.0 -0.07 0.3)
(0.0 -0.07 0.5)
(0.0 -0.04 0.5)
(0.0 0.14 0.5)
(0.0 0.17 0.5)
(0.0 -0.04 0.33)
(0.0 0.14 0.33)
(0 0.025 0.02)
(0 0.075 0.02)
(0 0.075 0.04)
(0 0.025 0.04)
(0 0.0 0.33)
(0 0.1 0.33)
(-0.1 0.0 0.0)
(-0.1 0.1 0.0)
(-0.1 0.0 0.15)
(-0.1 0.1 0.15)
(-0.1 0.1 0.16)
(-0.1 0.0 0.16)
(-0.1 0.0 0.3)
(-0.1 0.1 0.3)
(-0.1 0.17 0.3)
(-0.1 -0.07 0.3)
(-0.1 -0.07 0.5)
(-0.1 -0.04 0.5)
(-0.1 0.14 0.5)
(-0.1 0.17 0.5)
(-0.1 -0.04 0.33)
(-0.1 0.14 0.33)
(-0.1 0.025 0.02)
(-0.1 0.075 0.02)
(-0.1 0.075 0.04)
(-0.1 0.025 0.04)
(-0.1 0.0 0.33)
(-0.1 0.1 0.33)
(0 -0.04 0.3)
(-0.1 -0.04 0.3)
(0 0.14 0.3)
(-0.1 0.14 0.3)
(0 -0.07 0.33)
(-0.1 -0.07 0.33)
(0 0.17 0.33)
(-0.1 0.17 0.33)

);

blocks
(
hex (16 17 39 38 19 18 40 41) (1 1 1) simpleGrading (1 1 1)
hex (0 1 23 22 2 3 25 24) (1 1 1) simpleGrading (1 1 1)
hex (5 4 26 27 6 7 29 28) (1 1 1) simpleGrading (1 1 1)
hex (2 3 25 24 5 4 26 27) (1 1 1) simpleGrading (1 1 1)
hex (6 7 29 28 20 21 43 42) (1 1 1) simpleGrading (1 1 1)
hex (7 46 47 29 21 15 37 43) (1 1 1) simpleGrading (1 1 1)
hex (44 6 28 45 14 20 42 36) (1 1 1) simpleGrading (1 1 1)
hex (9 44 45 31 48 14 36 49) (1 1 1) simpleGrading (1 1 1)
hex (48 14 36 49 10 11 33 32) (1 1 1) simpleGrading (1 1 1)
hex (46 8 30 47 15 50 51 37) (1 1 1) simpleGrading (1 1 1)
hex (15 50 51 37 12 13 35 34) (1 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
fuel
{
type patch;
faces
(
(19 18 40 41)
(16 17 39 38)
(38 16 19 41)
(17 39 40 18)
);
}
primary_air
{
type patch;
faces
(
(0 1 23 22)
);
}
Secondary_air_RHS
{
type patch;
faces
(
(3 25 26 4)
);
}
Secondary_air_LHS
{
type patch;
faces
(
(2 24 27 5)
);
}
outlet
{
type patch;
faces
(
(12 13 35 34)
(10 11 33 32)
);
}
stove_body
{
type patch;
faces
(
(22 0 2 24)
(1 23 25 3)
(5 27 28 6)
(4 26 29 7)
(20 21 43 42)
(14 20 42 36)
(44 6 28 45)
(21 15 37 43)
(7 46 47 29)
(14 36 33 11)
(48 49 32 10)
(9 44 45 31)
(15 37 34 12)
(50 51 35 13)
(46 8 30 47)
(8 30 51 50)
(9 31 49 48)
);
}

frontAndBack
{
type empty;
faces
(
(16 17 18 19)
(38 39 40 41)
(0 1 3 2)
(22 23 25 24)
(2 3 4 5)
(24 25 26 27)
(5 4 7 6)
(27 28 29 26)
(6 7 21 20)
(28 29 43 42)
(44 6 20 14)
(45 28 42 36)
(29 47 37 43)
(7 46 15 21)
(9 44 14 48)
(48 14 11 10)
(31 45 36 49)
(49 36 33 32)
(46 8 50 15)
(15 50 13 12)
(47 30 51 37)
(37 51 35 34)
);
}
);

mergePatchPairs
(
);
// ************************************************************************* //